Samples/Output/net10.0/d2/dependency-diagram-generator-all.d2
direction: left

diagramgeneratorsample: DiagramGeneratorSample
microsoft-extensions-configuration_10-0-8: Microsoft.Extensions.Configuration\nv10.0.8
microsoft-extensions-configuration-abstractions_10-0-8: Microsoft.Extensions.Configuration.Abstractions\nv10.0.8
microsoft-extensions-primitives_10-0-8: Microsoft.Extensions.Primitives\nv10.0.8
microsoft-extensions-configuration-binder_10-0-8: Microsoft.Extensions.Configuration.Binder\nv10.0.8
microsoft-extensions-configuration-json_10-0-8: Microsoft.Extensions.Configuration.Json\nv10.0.8
microsoft-extensions-configuration-fileextensions_10-0-8: Microsoft.Extensions.Configuration.FileExtensions\nv10.0.8
microsoft-extensions-fileproviders-abstractions_10-0-8: Microsoft.Extensions.FileProviders.Abstractions\nv10.0.8
microsoft-extensions-dependencyinjection_10-0-8: Microsoft.Extensions.DependencyInjection\nv10.0.8
microsoft-extensions-dependencyinjection-abstractions_10-0-8: Microsoft.Extensions.DependencyInjection.Abstractions\nv10.0.8
microsoft-extensions-logging-console_10-0-8: Microsoft.Extensions.Logging.Console\nv10.0.8
microsoft-extensions-logging_10-0-8: Microsoft.Extensions.Logging\nv10.0.8
microsoft-extensions-logging-abstractions_10-0-8: Microsoft.Extensions.Logging.Abstractions\nv10.0.8
microsoft-extensions-logging-configuration_10-0-8: Microsoft.Extensions.Logging.Configuration\nv10.0.8
microsoft-extensions-options_10-0-8: Microsoft.Extensions.Options\nv10.0.8
slndependencydiagramgenerator: SlnDependencyDiagramGenerator
alloverit_9-2-1: AllOverIt\nv9.2.1
alloverit-assertion_9-2-1: AllOverIt.Assertion\nv9.2.1
alloverit-validation_9-2-1: AllOverIt.Validation\nv9.2.1
fluentvalidation_12-1-1: FluentValidation\nv12.1.1
microsoft-build-locator_1-11-2: Microsoft.Build.Locator\nv1.11.2
microsoft-visualstudio-solutionpersistence_1-0-52: Microsoft.VisualStudio.SolutionPersistence\nv1.0.52
nuget-frameworks_7-6-0: NuGet.Frameworks\nv7.6.0
nuget-projectmodel_7-6-0: NuGet.ProjectModel\nv7.6.0
nuget-dependencyresolver-core_7-6-0: NuGet.DependencyResolver.Core\nv7.6.0
nuget-protocol_7-6-0: NuGet.Protocol\nv7.6.0
nuget-packaging_7-6-0: NuGet.Packaging\nv7.6.0
nugetconflictsample: NugetConflictSample
alloverit_9-2-0: AllOverIt\nv9.2.0
alloverit-assertion_9-2-0: AllOverIt.Assertion\nv9.2.0
nuget-protocol_7-3-1: NuGet.Protocol\nv7.3.1
nuget-packaging_7-3-1: NuGet.Packaging\nv7.3.1
microsoft-extensions-configuration_10-0-8 <- diagramgeneratorsample
microsoft-extensions-configuration-abstractions_10-0-8 <- microsoft-extensions-configuration_10-0-8
microsoft-extensions-primitives_10-0-8 <- microsoft-extensions-configuration_10-0-8
microsoft-extensions-configuration-binder_10-0-8 <- diagramgeneratorsample
microsoft-extensions-configuration_10-0-8 <- microsoft-extensions-configuration-binder_10-0-8
microsoft-extensions-configuration-abstractions_10-0-8 <- microsoft-extensions-configuration-binder_10-0-8
microsoft-extensions-configuration-json_10-0-8 <- diagramgeneratorsample
microsoft-extensions-configuration_10-0-8 <- microsoft-extensions-configuration-json_10-0-8
microsoft-extensions-configuration-abstractions_10-0-8 <- microsoft-extensions-configuration-json_10-0-8
microsoft-extensions-configuration-fileextensions_10-0-8 <- microsoft-extensions-configuration-json_10-0-8
microsoft-extensions-fileproviders-abstractions_10-0-8 <- microsoft-extensions-configuration-json_10-0-8
microsoft-extensions-dependencyinjection_10-0-8 <- diagramgeneratorsample
microsoft-extensions-dependencyinjection-abstractions_10-0-8 <- microsoft-extensions-dependencyinjection_10-0-8
microsoft-extensions-logging-console_10-0-8 <- diagramgeneratorsample
microsoft-extensions-dependencyinjection-abstractions_10-0-8 <- microsoft-extensions-logging-console_10-0-8
microsoft-extensions-logging_10-0-8 <- microsoft-extensions-logging-console_10-0-8
microsoft-extensions-logging-abstractions_10-0-8 <- microsoft-extensions-logging-console_10-0-8
microsoft-extensions-logging-configuration_10-0-8 <- microsoft-extensions-logging-console_10-0-8
microsoft-extensions-options_10-0-8 <- microsoft-extensions-logging-console_10-0-8
slndependencydiagramgenerator <- diagramgeneratorsample
alloverit_9-2-1 <- slndependencydiagramgenerator
alloverit-assertion_9-2-1 <- alloverit_9-2-1
alloverit-validation_9-2-1 <- slndependencydiagramgenerator
alloverit_9-2-1 <- alloverit-validation_9-2-1
fluentvalidation_12-1-1 <- alloverit-validation_9-2-1
microsoft-extensions-dependencyinjection-abstractions_10-0-8 <- alloverit-validation_9-2-1
microsoft-build-locator_1-11-2 <- slndependencydiagramgenerator
microsoft-extensions-dependencyinjection-abstractions_10-0-8 <- slndependencydiagramgenerator
microsoft-extensions-logging-abstractions_10-0-8 <- slndependencydiagramgenerator
microsoft-extensions-dependencyinjection-abstractions_10-0-8 <- microsoft-extensions-logging-abstractions_10-0-8
microsoft-visualstudio-solutionpersistence_1-0-52 <- slndependencydiagramgenerator
nuget-frameworks_7-6-0 <- slndependencydiagramgenerator
nuget-projectmodel_7-6-0 <- slndependencydiagramgenerator
nuget-dependencyresolver-core_7-6-0 <- nuget-projectmodel_7-6-0
nuget-protocol_7-6-0 <- slndependencydiagramgenerator
nuget-packaging_7-6-0 <- nuget-protocol_7-6-0
alloverit_9-2-0 <- nugetconflictsample
alloverit-assertion_9-2-0 <- alloverit_9-2-0
nuget-protocol_7-3-1 <- nugetconflictsample
nuget-packaging_7-3-1 <- nuget-protocol_7-3-1
microsoft-extensions-configuration_10-0-8.style.fill: "#ADD8E6"
microsoft-extensions-configuration_10-0-8.style.opacity: 0.8
microsoft-extensions-configuration-abstractions_10-0-8.style.fill: "#FFEC96"
microsoft-extensions-configuration-abstractions_10-0-8.style.opacity: 0.8
microsoft-extensions-primitives_10-0-8.style.fill: "#FFEC96"
microsoft-extensions-primitives_10-0-8.style.opacity: 0.8
microsoft-extensions-configuration-binder_10-0-8.style.fill: "#ADD8E6"
microsoft-extensions-configuration-binder_10-0-8.style.opacity: 0.8
microsoft-extensions-configuration-json_10-0-8.style.fill: "#ADD8E6"
microsoft-extensions-configuration-json_10-0-8.style.opacity: 0.8
microsoft-extensions-configuration-fileextensions_10-0-8.style.fill: "#FFEC96"
microsoft-extensions-configuration-fileextensions_10-0-8.style.opacity: 0.8
microsoft-extensions-fileproviders-abstractions_10-0-8.style.fill: "#FFEC96"
microsoft-extensions-fileproviders-abstractions_10-0-8.style.opacity: 0.8
microsoft-extensions-dependencyinjection_10-0-8.style.fill: "#ADD8E6"
microsoft-extensions-dependencyinjection_10-0-8.style.opacity: 0.8
microsoft-extensions-dependencyinjection-abstractions_10-0-8.style.fill: "#ADD8E6"
microsoft-extensions-dependencyinjection-abstractions_10-0-8.style.opacity: 0.8
microsoft-extensions-logging-console_10-0-8.style.fill: "#ADD8E6"
microsoft-extensions-logging-console_10-0-8.style.opacity: 0.8
microsoft-extensions-logging_10-0-8.style.fill: "#FFEC96"
microsoft-extensions-logging_10-0-8.style.opacity: 0.8
microsoft-extensions-logging-abstractions_10-0-8.style.fill: "#ADD8E6"
microsoft-extensions-logging-abstractions_10-0-8.style.opacity: 0.8
microsoft-extensions-logging-configuration_10-0-8.style.fill: "#FFEC96"
microsoft-extensions-logging-configuration_10-0-8.style.opacity: 0.8
microsoft-extensions-options_10-0-8.style.fill: "#FFEC96"
microsoft-extensions-options_10-0-8.style.opacity: 0.8
alloverit_9-2-1.style.fill: "#ADD8E6"
alloverit_9-2-1.style.opacity: 0.8
alloverit-assertion_9-2-1.style.fill: "#FFEC96"
alloverit-assertion_9-2-1.style.opacity: 0.8
alloverit-validation_9-2-1.style.fill: "#ADD8E6"
alloverit-validation_9-2-1.style.opacity: 0.8
fluentvalidation_12-1-1.style.fill: "#FFEC96"
fluentvalidation_12-1-1.style.opacity: 0.8
microsoft-build-locator_1-11-2.style.fill: "#ADD8E6"
microsoft-build-locator_1-11-2.style.opacity: 0.8
microsoft-visualstudio-solutionpersistence_1-0-52.style.fill: "#ADD8E6"
microsoft-visualstudio-solutionpersistence_1-0-52.style.opacity: 0.8
nuget-frameworks_7-6-0.style.fill: "#ADD8E6"
nuget-frameworks_7-6-0.style.opacity: 0.8
nuget-projectmodel_7-6-0.style.fill: "#ADD8E6"
nuget-projectmodel_7-6-0.style.opacity: 0.8
nuget-dependencyresolver-core_7-6-0.style.fill: "#FFEC96"
nuget-dependencyresolver-core_7-6-0.style.opacity: 0.8
nuget-protocol_7-6-0.style.fill: "#ADD8E6"
nuget-protocol_7-6-0.style.opacity: 0.8
nuget-packaging_7-6-0.style.fill: "#FFEC96"
nuget-packaging_7-6-0.style.opacity: 0.8
alloverit_9-2-0.style.fill: "#ADD8E6"
alloverit_9-2-0.style.opacity: 0.8
alloverit-assertion_9-2-0.style.fill: "#FFEC96"
alloverit-assertion_9-2-0.style.opacity: 0.8
nuget-protocol_7-3-1.style.fill: "#ADD8E6"
nuget-protocol_7-3-1.style.opacity: 0.8
nuget-packaging_7-3-1.style.fill: "#FFEC96"
nuget-packaging_7-3-1.style.opacity: 0.8
