Samples/Output/net10.0/mmd/dependency-diagram-generator-all.mmd
flowchart LR
  diagramgeneratorsample["DiagramGeneratorSample"]
  microsoft-extensions-configuration_10-0-8["Microsoft.Extensions.Configuration<br>v10.0.8"]
  microsoft-extensions-configuration-abstractions_10-0-8["Microsoft.Extensions.Configuration.Abstractions<br>v10.0.8"]
  microsoft-extensions-primitives_10-0-8["Microsoft.Extensions.Primitives<br>v10.0.8"]
  microsoft-extensions-configuration-binder_10-0-8["Microsoft.Extensions.Configuration.Binder<br>v10.0.8"]
  microsoft-extensions-configuration-json_10-0-8["Microsoft.Extensions.Configuration.Json<br>v10.0.8"]
  microsoft-extensions-configuration-fileextensions_10-0-8["Microsoft.Extensions.Configuration.FileExtensions<br>v10.0.8"]
  microsoft-extensions-fileproviders-abstractions_10-0-8["Microsoft.Extensions.FileProviders.Abstractions<br>v10.0.8"]
  microsoft-extensions-dependencyinjection_10-0-8["Microsoft.Extensions.DependencyInjection<br>v10.0.8"]
  microsoft-extensions-dependencyinjection-abstractions_10-0-8["Microsoft.Extensions.DependencyInjection.Abstractions<br>v10.0.8"]
  microsoft-extensions-logging-console_10-0-8["Microsoft.Extensions.Logging.Console<br>v10.0.8"]
  microsoft-extensions-logging_10-0-8["Microsoft.Extensions.Logging<br>v10.0.8"]
  microsoft-extensions-logging-abstractions_10-0-8["Microsoft.Extensions.Logging.Abstractions<br>v10.0.8"]
  microsoft-extensions-logging-configuration_10-0-8["Microsoft.Extensions.Logging.Configuration<br>v10.0.8"]
  microsoft-extensions-options_10-0-8["Microsoft.Extensions.Options<br>v10.0.8"]
  slndependencydiagramgenerator["SlnDependencyDiagramGenerator"]
  alloverit_9-2-1["AllOverIt<br>v9.2.1"]
  alloverit-assertion_9-2-1["AllOverIt.Assertion<br>v9.2.1"]
  alloverit-validation_9-2-1["AllOverIt.Validation<br>v9.2.1"]
  fluentvalidation_12-1-1["FluentValidation<br>v12.1.1"]
  microsoft-build-locator_1-11-2["Microsoft.Build.Locator<br>v1.11.2"]
  microsoft-visualstudio-solutionpersistence_1-0-52["Microsoft.VisualStudio.SolutionPersistence<br>v1.0.52"]
  nuget-frameworks_7-6-0["NuGet.Frameworks<br>v7.6.0"]
  nuget-projectmodel_7-6-0["NuGet.ProjectModel<br>v7.6.0"]
  nuget-dependencyresolver-core_7-6-0["NuGet.DependencyResolver.Core<br>v7.6.0"]
  nuget-protocol_7-6-0["NuGet.Protocol<br>v7.6.0"]
  nuget-packaging_7-6-0["NuGet.Packaging<br>v7.6.0"]
  nugetconflictsample["NugetConflictSample"]
  alloverit_9-2-0["AllOverIt<br>v9.2.0"]
  alloverit-assertion_9-2-0["AllOverIt.Assertion<br>v9.2.0"]
  nuget-protocol_7-3-1["NuGet.Protocol<br>v7.3.1"]
  nuget-packaging_7-3-1["NuGet.Packaging<br>v7.3.1"]
  diagramgeneratorsample --> microsoft-extensions-configuration_10-0-8
  microsoft-extensions-configuration_10-0-8 --> microsoft-extensions-configuration-abstractions_10-0-8
  microsoft-extensions-configuration_10-0-8 --> microsoft-extensions-primitives_10-0-8
  diagramgeneratorsample --> microsoft-extensions-configuration-binder_10-0-8
  microsoft-extensions-configuration-binder_10-0-8 --> microsoft-extensions-configuration_10-0-8
  microsoft-extensions-configuration-binder_10-0-8 --> microsoft-extensions-configuration-abstractions_10-0-8
  diagramgeneratorsample --> microsoft-extensions-configuration-json_10-0-8
  microsoft-extensions-configuration-json_10-0-8 --> microsoft-extensions-configuration_10-0-8
  microsoft-extensions-configuration-json_10-0-8 --> microsoft-extensions-configuration-abstractions_10-0-8
  microsoft-extensions-configuration-json_10-0-8 --> microsoft-extensions-configuration-fileextensions_10-0-8
  microsoft-extensions-configuration-json_10-0-8 --> microsoft-extensions-fileproviders-abstractions_10-0-8
  diagramgeneratorsample --> microsoft-extensions-dependencyinjection_10-0-8
  microsoft-extensions-dependencyinjection_10-0-8 --> microsoft-extensions-dependencyinjection-abstractions_10-0-8
  diagramgeneratorsample --> microsoft-extensions-logging-console_10-0-8
  microsoft-extensions-logging-console_10-0-8 --> microsoft-extensions-dependencyinjection-abstractions_10-0-8
  microsoft-extensions-logging-console_10-0-8 --> microsoft-extensions-logging_10-0-8
  microsoft-extensions-logging-console_10-0-8 --> microsoft-extensions-logging-abstractions_10-0-8
  microsoft-extensions-logging-console_10-0-8 --> microsoft-extensions-logging-configuration_10-0-8
  microsoft-extensions-logging-console_10-0-8 --> microsoft-extensions-options_10-0-8
  diagramgeneratorsample --> slndependencydiagramgenerator
  slndependencydiagramgenerator --> alloverit_9-2-1
  alloverit_9-2-1 --> alloverit-assertion_9-2-1
  slndependencydiagramgenerator --> alloverit-validation_9-2-1
  alloverit-validation_9-2-1 --> alloverit_9-2-1
  alloverit-validation_9-2-1 --> fluentvalidation_12-1-1
  alloverit-validation_9-2-1 --> microsoft-extensions-dependencyinjection-abstractions_10-0-8
  slndependencydiagramgenerator --> microsoft-build-locator_1-11-2
  slndependencydiagramgenerator --> microsoft-extensions-dependencyinjection-abstractions_10-0-8
  slndependencydiagramgenerator --> microsoft-extensions-logging-abstractions_10-0-8
  microsoft-extensions-logging-abstractions_10-0-8 --> microsoft-extensions-dependencyinjection-abstractions_10-0-8
  slndependencydiagramgenerator --> microsoft-visualstudio-solutionpersistence_1-0-52
  slndependencydiagramgenerator --> nuget-frameworks_7-6-0
  slndependencydiagramgenerator --> nuget-projectmodel_7-6-0
  nuget-projectmodel_7-6-0 --> nuget-dependencyresolver-core_7-6-0
  slndependencydiagramgenerator --> nuget-protocol_7-6-0
  nuget-protocol_7-6-0 --> nuget-packaging_7-6-0
  nugetconflictsample --> alloverit_9-2-0
  alloverit_9-2-0 --> alloverit-assertion_9-2-0
  nugetconflictsample --> nuget-protocol_7-3-1
  nuget-protocol_7-3-1 --> nuget-packaging_7-3-1
  style microsoft-extensions-configuration_10-0-8 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-configuration-abstractions_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-primitives_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-configuration-binder_10-0-8 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-configuration-json_10-0-8 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-configuration-fileextensions_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-fileproviders-abstractions_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-dependencyinjection_10-0-8 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-dependencyinjection-abstractions_10-0-8 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-logging-console_10-0-8 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-logging_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-logging-abstractions_10-0-8 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-logging-configuration_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-options_10-0-8 fill:#FFEC96,opacity:0.8
  style alloverit_9-2-1 fill:#ADD8E6,opacity:0.8
  style alloverit-assertion_9-2-1 fill:#FFEC96,opacity:0.8
  style alloverit-validation_9-2-1 fill:#ADD8E6,opacity:0.8
  style fluentvalidation_12-1-1 fill:#FFEC96,opacity:0.8
  style microsoft-build-locator_1-11-2 fill:#ADD8E6,opacity:0.8
  style microsoft-visualstudio-solutionpersistence_1-0-52 fill:#ADD8E6,opacity:0.8
  style nuget-frameworks_7-6-0 fill:#ADD8E6,opacity:0.8
  style nuget-projectmodel_7-6-0 fill:#ADD8E6,opacity:0.8
  style nuget-dependencyresolver-core_7-6-0 fill:#FFEC96,opacity:0.8
  style nuget-protocol_7-6-0 fill:#ADD8E6,opacity:0.8
  style nuget-packaging_7-6-0 fill:#FFEC96,opacity:0.8
  style alloverit_9-2-0 fill:#ADD8E6,opacity:0.8
  style alloverit-assertion_9-2-0 fill:#FFEC96,opacity:0.8
  style nuget-protocol_7-3-1 fill:#ADD8E6,opacity:0.8
  style nuget-packaging_7-3-1 fill:#FFEC96,opacity:0.8
